[Survived] BlockStatement
trip-service.ts:3:41
 class CollaboratorCallException extends Error {}
 class UserSession {
-    public static getLoggedUser(): User {
-        throw new CollaboratorCallException(
-            "UserSession.getLoggedUser() should not be called in an unit test"
-        );
-    }
+    public static getLoggedUser(): User {}
 }
 class Trip {}

[Survived] StringLiteral
trip-service.ts:5:13
 class UserSession {
     public static getLoggedUser(): User {
         throw new CollaboratorCallException(
-            "UserSession.getLoggedUser() should not be called in an unit test"
+            ""
         );
     }

[Survived] ArrayDeclaration
trip-service.ts:12:29
 class Trip {}
 
 class User {
-    private trips: Trip[] = [];
+    private trips: Trip[] = ["Stryker was here"];
     private friends: User[] = [];
 

[Survived] BlockStatement
trip-service.ts:15:33
     private trips: Trip[] = [];
     private friends: User[] = [];
 
-    public getFriends(): User[] {
-        return this.friends;
-    }
+    public getFriends(): User[] {}
 
     public addFriend(user: User): void {

[Survived] BlockStatement
trip-service.ts:19:40
         return this.friends;
     }
 
-    public addFriend(user: User): void {
-        this.friends.push(user);
-    }
+    public addFriend(user: User): void {}
 
     public addTrip(trip: Trip): void {

[Survived] BlockStatement
trip-service.ts:23:38
         this.friends.push(user);
     }
 
-    public addTrip(trip: Trip): void {
-        this.trips.push(trip);
-    }
+    public addTrip(trip: Trip): void {}
 
     public getTrips(): Trip[] {

[Survived] BlockStatement
trip-service.ts:27:31
         this.trips.push(trip);
     }
 
-    public getTrips(): Trip[] {
-        return this.trips;
-    }
+    public getTrips(): Trip[] {}
 }
 export default class TripDAO {

[Survived] BlockStatement
trip-service.ts:32:55
     }
 }
 export default class TripDAO {
-    public static findTripsByUser(user: User): Trip[] {
-        throw new CollaboratorCallException(
-            "TripDAO should not be invoked on an unit test."
-        );
-    }
+    public static findTripsByUser(user: User): Trip[] {}
 }
 class UserNotLoggedInException extends Error {}

[Survived] BlockStatement
trip-service.ts:40:47
 }
 class UserNotLoggedInException extends Error {}
 class TripService {
-    public getTripsByUser(user: User): Trip[] {
-        let tripList: Trip[] = [];
-        const loggedUser: User = UserSession.getLoggedUser();
-        let isFriend: boolean = false;
-
-        if (loggedUser != null) {
-            for (const friend of user.getFriends()) {
-                if (friend === loggedUser) {
-                    isFriend = true;
-                    break;
-                }
-            }
-
-            if (isFriend) {
-                tripList = TripDAO.findTripsByUser(user);
-            }
-
-            return tripList;
-        } else {
-            throw new UserNotLoggedInException();
-        }
-    }
+    public getTripsByUser(user: User): Trip[] {}
 }
 

[Survived] BooleanLiteral
trip-service.ts:43:33
     public getTripsByUser(user: User): Trip[] {
         let tripList: Trip[] = [];
         const loggedUser: User = UserSession.getLoggedUser();
-        let isFriend: boolean = false;
+        let isFriend: boolean = true;
 
         if (loggedUser != null) {

[Survived] BlockStatement
trip-service.ts:45:33
         const loggedUser: User = UserSession.getLoggedUser();
         let isFriend: boolean = false;
 
-        if (loggedUser != null) {
-            for (const friend of user.getFriends()) {
-                if (friend === loggedUser) {
-                    isFriend = true;
-                    break;
-                }
-            }
-
-            if (isFriend) {
-                tripList = TripDAO.findTripsByUser(user);
-            }
-
-            return tripList;
-        } else {
+        if (loggedUser != null) {} else {
             throw new UserNotLoggedInException();
         }

[Survived] ConditionalExpression
trip-service.ts:45:13
         const loggedUser: User = UserSession.getLoggedUser();
         let isFriend: boolean = false;
 
-        if (loggedUser != null) {
+        if (true) {
             for (const friend of user.getFriends()) {
                 if (friend === loggedUser) {

[Survived] BlockStatement
trip-service.ts:46:53
         let isFriend: boolean = false;
 
         if (loggedUser != null) {
-            for (const friend of user.getFriends()) {
-                if (friend === loggedUser) {
-                    isFriend = true;
-                    break;
-                }
-            }
+            for (const friend of user.getFriends()) {}
 
             if (isFriend) {

[Survived] ConditionalExpression
trip-service.ts:47:21
 
         if (loggedUser != null) {
             for (const friend of user.getFriends()) {
-                if (friend === loggedUser) {
+                if (false) {
                     isFriend = true;
                     break;

[Survived] EqualityOperator
trip-service.ts:47:21
 
         if (loggedUser != null) {
             for (const friend of user.getFriends()) {
-                if (friend === loggedUser) {
+                if (friend !== loggedUser) {
                     isFriend = true;
                     break;

[Survived] BooleanLiteral
trip-service.ts:48:32
         if (loggedUser != null) {
             for (const friend of user.getFriends()) {
                 if (friend === loggedUser) {
-                    isFriend = true;
+                    isFriend = false;
                     break;
                 }

[Survived] BlockStatement
trip-service.ts:53:27
                 }
             }
 
-            if (isFriend) {
-                tripList = TripDAO.findTripsByUser(user);
-            }
+            if (isFriend) {}
 
             return tripList;

[Survived] ConditionalExpression
trip-service.ts:53:17
                 }
             }
 
-            if (isFriend) {
+            if (false) {
                 tripList = TripDAO.findTripsByUser(user);
             }

[Survived] BlockStatement
trip-service.ts:58:16
             }
 
             return tripList;
-        } else {
-            throw new UserNotLoggedInException();
-        }
+        } else {}
     }
 }

[Killed] StringLiteral
trip-service.ts:64:13
     }
 }
 
-console.log("test");
+console.log("");
 
killedBy: All tests
statusReason: 1c1
< 
---
> test
